Revit 2024 API
PanelScheduleData.SummaryShowsOnlyConnectedLoads Property
 Show only the connected load classifications in the summary section
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool SummaryShowsOnlyConnectedLoads { get; set; }
Visual Basic
Public Property SummaryShowsOnlyConnectedLoads As Boolean
	Get
	Set
Visual C++
public:
property bool SummaryShowsOnlyConnectedLoads {
	bool get ();
	void set (bool value);
}
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace